Done/Month02/Week2/oe2309test2_x86_round1/logs/fio/oe_test_fio_002/2023-08-17-10_28_37.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Thu Aug 17 10:28:38 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks='sr0 vdb'
+ disk_list=($disks)
+ local_disk=sr0
+ local_disk1=vdb
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
+ tmpfile2=/tmp/tmplait6bsp
+ '[' -z '' ']'
+ tmpfile=/tmp/tmplait6bsp
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Thu Aug 17 10:30:19 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Thu Aug 17 10:30:19 2023 - INFO  - Start executing testcase!
+ grep 'items processed'
+ fio-dedupe -o 1 /dev/sr0
open: No medium found
+ CHECK_RESULT 1 0 0 'fio-dedupe -o option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -o option failed'
+ LOG_ERROR 'fio-dedupe -o option failed'
+ message='fio-dedupe -o option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -o option failed'
Thu Aug 17 10:30:19 2023 - ERROR - fio-dedupe -o option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 31'
+ message='oe_test_fio_002.sh line 31'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 31'
Thu Aug 17 10:30:19 2023 - ERROR - oe_test_fio_002.sh line 31
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -c 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -c option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -B 1 /dev/vdb
Will check </dev/vdb>, size <524288000>, using 4 threads
Threads(4): 128000 items processed
Extents=128000, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -B option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -p 1 /dev/vdb
Will check </dev/vdb>, size <524288000>, using 4 threads
Threads(4): 128000 items processed
Extents=128000, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -p option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=1985: Thu Aug 17 10:30:32 2023
  write: IOPS=23.3k, BW=91.2MiB/s (95.6MB/s)(1024MiB/11231msec); 0 zone resets
    slat (usec): min=4, max=820, avg=17.26, stdev=10.66
    clat (usec): min=26, max=4275.7k, avg=666.93, stdev=34620.65
     lat (usec): min=37, max=4275.7k, avg=684.19, stdev=34620.59
    clat percentiles (usec):
     |  1.00th=[    202],  5.00th=[    241], 10.00th=[    255],
     | 20.00th=[    273], 30.00th=[    281], 40.00th=[    293],
     | 50.00th=[    302], 60.00th=[    314], 70.00th=[    330],
     | 80.00th=[    347], 90.00th=[    383], 95.00th=[    433],
     | 99.00th=[    562], 99.50th=[    644], 99.90th=[   1401],
     | 99.95th=[   1598], 99.99th=[1132463]
   bw (  KiB/s): min=24112, max=210408, per=100.00%, avg=142158.07, stdev=69212.67, samples=14
   iops        : min= 6028, max=52602, avg=35539.71, stdev=17302.77, samples=14
  lat (usec)   : 50=0.02%, 100=0.11%, 250=7.69%, 500=90.00%, 750=1.78%
  lat (usec)   : 1000=0.11%
  lat (msec)   : 2=0.26%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (msec)   : 500=0.01%, 2000=0.01%, >=2000=0.01%
  cpu          : usr=4.85%, sys=25.30%, ctx=177909, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=91.2MiB/s (95.6MB/s), 91.2MiB/s-91.2MiB/s (95.6MB/s-95.6MB/s), io=1024MiB (1074MB), run=11231-11231msec

Disk stats (read/write):
  vda: ios=0/257201, merge=0/1289, ticks=0/108315, in_queue=113742, util=99.19%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Thu Aug 17 10:30:33 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 41'
+ message='oe_test_fio_002.sh line 41'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 41'
Thu Aug 17 10:30:33 2023 - ERROR - oe_test_fio_002.sh line 41
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Thu Aug 17 10:30:35 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 43'
+ message='oe_test_fio_002.sh line 43'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 43'
Thu Aug 17 10:30:35 2023 - ERROR - oe_test_fio_002.sh line 43
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.34
Starting 30 threads

mytest: (groupid=0, jobs=30): err= 0: pid=1999: Thu Aug 17 10:30:39 2023
  read: IOPS=260k, BW=4068MiB/s (4266MB/s)(14.6GiB/3687msec)
    clat (usec): min=16, max=1157.3k, avg=102.29, stdev=1686.89
     lat (usec): min=16, max=1157.3k, avg=102.37, stdev=1686.89
    clat percentiles (usec):
     |  1.00th=[   23],  5.00th=[   45], 10.00th=[   59], 20.00th=[   78],
     | 30.00th=[   86], 40.00th=[   91], 50.00th=[   96], 60.00th=[  103],
     | 70.00th=[  116], 80.00th=[  126], 90.00th=[  141], 95.00th=[  153],
     | 99.00th=[  184], 99.50th=[  200], 99.90th=[  265], 99.95th=[  306],
     | 99.99th=[  416]
   bw (  MiB/s): min= 4028, max= 5383, per=100.00%, avg=4525.90, stdev=23.01, samples=180
   iops        : min=257801, max=344516, avg=289656.50, stdev=1472.57, samples=180
  lat (usec)   : 20=0.28%, 50=6.54%, 100=49.53%, 250=43.52%, 500=0.13%
  lat (usec)   : 750=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 250=0.01%, 2000=0.01%
  cpu          : usr=1.28%, sys=3.81%, ctx=973509, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=960000,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4068MiB/s (4266MB/s), 4068MiB/s-4068MiB/s (4266MB/s-4266MB/s), io=14.6GiB (15.7GB), run=3687-3687msec

Disk stats (read/write):
  vdb: ios=956382/0, merge=0/0, ticks=74984/0, in_queue=74984, util=85.48%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Thu Aug 17 10:30:40 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 47'
+ message='oe_test_fio_002.sh line 47'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 47'
Thu Aug 17 10:30:40 2023 - ERROR - oe_test_fio_002.sh line 47
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/sr0,/dev/vdb,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
/usr/bin/genfio: line 280: hostname: command not found
Generating dellr720-day2/-4k,128k,1m-all-write,randwrite,read,randread-sr0,vdb,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Thu Aug 17 10:30:42 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 4
+ test 4 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Thu Aug 17 10:30:42 2023 - ERROR - failed to execute the case.
+ exit 4
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Thu Aug 17 10:30:42 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmplait6bsp ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/mugen/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmplait6bsp
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Thu Aug 17 10:30:47 2023 - INFO  - Finish environment cleanup.